// {
// "id": 2,
// "title": "Omnipotent Love",
// "slug": "omnipotent-love",
// "markdown": "Yesterday, after a full day of fun and festivities celebrating CCA's graduating class of 2014, we headed home for some well deserved rest. Linden had been happy and playing all day and had been feeling mostly well if not a tad grouchy in the evening.\n\nAt 11:30 PM she woke up per usual to show us her signature smile and let us know she was thinking of us :) I went in to say hello and noticed she was burning up. Her temp was 103 when we took it, and we decided to call our GI doc. He suggested we come to the ER in Peoria to get her checked out and started on antibiotics. Thankfully the Grabow family and Marcia (Graham's second mother) were gracious enough to take Graham in a let him crash there for the night, Graham didn't complain at all :)\n\nWe arrived at the ER at about 12:45 AM and were quickly moved back to our room where we were met by 4 staff, immediately followed by the attending physician a few minutes later. They were the best and fastest working team we have ever experienced when getting checked in to the ER. We were admitted to the hospital and on our way to our room within a few hours after the obligatory pokes and blood draws and fluid samples.\n\nHer breathing and heartrate were quite accelerated, and along with her high fever, the attending made the decision to send her to the PICU which is the highest level of pediatric care you can get here at the hospital. We got up to our room between 2:30 and 3:00 AM and after some more blood draws, monitor hook ups, diaper changes, and the like, she finally konked out around 4:30 this morning. \n\n###Rise and shine\n\nOur amazing nurse let us sleep in until about 9:30 this morning and took care of changing Linden and getting her meds and fluids all in order. The rouding doctors and attending came in within the hour and let us know where her numbers were at. \n\nLong story short, medical terminology aside, she likely has some sort of infection that is causing swelling near the area of her surgery, which causes things to go a bit wacky. This is a somewhat common thing for kids with her disease and they will likely treat it with antibiotics and watch her numbers for a few days. She also had low hemoglobin so they are giving her a blood transfusion as well. She's also on some happy juice which is helping her get some good rest.\n\nOur prayer is that she gets better over the next few days with antibiotics, and that she can be home by the middle or late part of the week.\n\n##Blessings\n\nIt can be easy to be cynical but it is always amazing to look at the flip side of the coin and see God's providence working through the circumstances.\n\n**1. Tomorrow is Memorial day**\n\nI don't think they will let us wheel a grill in here but hey, who knows right? The great part though is that I don't have to make up work in order to be here at the hospital. Perfect timing!\n\n**2. Higher PELD score**\n\nLinden is actually scheduled for an appointment at Cincinatti Children's Hospital on June 4th which is when they will list her for a liver transplant. The amount of time you have to wait for a transplant is based on a very complicated scoring system. The higher your score, the sooner you get trasplanted. While it is never fun when Linden is sick, this means her PELD score (the transplant score) will be higher when she gets listed meaning a faster transplant!\n\n**3. Medical Bills**\n\nLastly, while medical bills are never great, OSF in their extreme awesomeness has granted our family some assistance in this area for any care given through their hospitals. Basically any bills we incur through this hospital cost us far less than they do elsewhere. We will hit the cap on our policy one way or the other this year, and the more bills we can put towards our deductible through OSF, the better off we are. \n\n\n##Omnipotent Love\n\nWanted to share this quote lastly, which points to the source of our hope and joy during these times.\n\n> The great thing in prayer is to feel that we are putting our supplications into the bosom of omnipotent love. — Andrew Murray\n\nWe can offer up our requests to a God that we can know loves us not simply because he says he does in his word, but because he proved it with action when he sent his greatest gift to the world to redeem us. \n\n> For God loved the world so much that he gave his one and only Son, so that everyone who believes in him will not perish but have eternal life. — John 3:16\n\nI don't have to worry that I am offering the deepest desires of my heart to an impartial and uncaring God, I can know that I pray to a God that hears, that cares, that loves, and that answers always according to His perfect will and always in perfect time. \n\nTo learn more about this awesome God and His amazing love, check out [this message](http://cbcnormal.org/resources/sermons/the-god-who-loves/) by our pastor [Josh Wredberg](https://twitter.com/jwredberg)\n\n---\n\nThank you for all the prayers and kind words on facebook, through texts and in passing. They mean the world to us :)\n\n\n",
// "published_at": "2014-05-25T19:44:00.000Z",
// },
// {
// "id": 3,
// "title": "Welcome to Linden's Blog",
// "slug": "welcome-to-lindens-blog",
// "markdown": "![](/content/images/2014/May/Linden.jpg)\n\nLaura and I were talking recently and realized just how much we had forgotten during Linden's journey over the last year. We wanted to have a place to recognize and record God's grace and the unmerited favor he has shown us during her journey also provide a way to keep family and friends up to date on Linden's progress towards transplant.\n\nThanks for taking the time to care about and show **love for Linden** ;)",
// "published_at": "2014-05-25T19:00:00.000Z",
// },
// {
// "id": 4,
// "title": "Linden's Story",
// "slug": "lindens-story",
// "markdown": "Linden was born on April 30th, 2013, 3 1/2 weeks early. The first 9 weeks of her life were very normal; Jake and I adjusting to two kids, sleepless nights, and a lot of dirty diapers, feedings, and baby cuddles. \n\n>At about 8 weeks, we noticed that Linden's skin color was very yellow.\n\nShe did have a touch of jaundice at birth, so we assumed she was still fighting the jaundice and it would go away with time. At 10 weeks, July 7th to be exact, we were at church and one of our dear friends, Lauren was visiting from Florida. Lauren is a nurse and she mentioned her coloring to us. She calmly, but highly suggested we take Linden to the doctor to be checked out.\n\n***Side note**: Even though Lauren was in Florida through the next few weeks, she was there for us every step of the way. Texting, calling, praying, encouraging, and an answer to those crazy medical questions that we didn't understand. She will never know all she did for us. <3* \n\nJake and I were both still at ease, thinking her pediatrician would send us home with a phototherapy blanket and she would be fine. I called our pediatrician on Monday and made an appointment for Tuesday afternoon. On Tuesday, July 9th Graham, Linden, and I moseyed on in to the doctors office, still not very concerned. \n\nI remember the nurse looking at her and then calling our doctor in immediately. One by one several nurses came in to get a peak at her and give their opinion; pretty unsettling, but still talking myself through the fact that everything was going to be fine. Our doctor said he was going to make a few phone calls and would be right back. \n>He returned what seemed like an eternity later and said he wanted us to go straight to the Children's hospital in Peoria. THAT scared me. Her coloring, now a greenish yellow, was worrisome enough that she needed to go to a Children's hospital?? \n\nI remember texting Jake at work  a billion times. Our pediatrician came back in and I asked \"How serious is this?\" and he answered, \"If this were my daughter, then I would want her seen right away.\" My heart sank. \n\n\nAs we drove to Peoria (45 minutes away), we prayed, cried, and consoled each other. The unknown was so scary…was our sweet baby sick? What was wrong? We checked in and they immediately did bloodwork and sent us to get a sonogram of her liver.\n\n***Side note:** we happened to get the meanest sonogram tech on the face of the Earth who sighed at Linden's every squirm and cry. I wanted to punch her at the end of it, in Christian love of course. ;)* \n\nAfter the sonogram, which again seemed like an eternity, the *meanie tech* told us \"the sonogram looks okay, but her bloodwork is worrisome, so they are going to admit her. Let me lead you to admitting.\" We asked questions and she had no answers for us. We were scared, trusting our God to lead us through what we were about to encounter.\n\nThe first few days we met what seemed like a several dozen people. Everyone from doctors, to nurses, to the cafeteria staff were so kind and compassionate. After a week of running every test under the sun, they did a final test, a hydascan on Monday, July, 15<sup>th</sup>. This was the big test that they were pretty sure would give them the answers they were looking for. It would show if Linden's liver drainage and if her liver had any obvious blockage. I remember during the hydascan she had to lay under a machine for over an hour, and the sweet thing slept the entire time while Jake and I took turns rubbing her head and praying over her.\n\nThey sent us home on Monday and we returned on Tuesday to complete the final part of the test. After her test on Tuesday, the radiologist told us it didn't look like her liver was draining, but she couldn't know for sure until the hydascan was officially reviewed. In the mean time, they went ahead and admitted us on Tuesday afternoon (at this point, we obviously knew something was up since they didn't send us on our merry way). After being admitted we met with our GI doctor, who in such a short time we grew to love and trust. He gave us the news we were hoping we weren't going to get. \"Linden's liver isn't draining and we think we know what is wrong, but we can't know for sure unless we do surgery.\" My heart ached and the tears started to stream. \n\n>\"Surgery will probably be tomorrow and the surgeon will be in shortly to talk with you.\" \n\nLooking back, I can't believe I wasn't more of a basket case than I was, but I know that is only the grace of God. Many people were praying and we truly felt **a peace like none I've ever experienced.** Even though, it was such a difficult trial in our lives, God felt so near. I remember my sister Kari saying, \"You are being so strong, how are you doing this?\" And without even letting me answer, she answered \"It's God's grace. He gives just enough to make it through.\" She was right, I know my personality (worrier, planner, facts oriented) and those traits did not show their face much during this….only by God's grace. \n\n\nWithin the next few hours, we met our surgeon and was immediately impressed by him. He explained and drew a picture of the exact procedure they were going to do. First, they would double check to make sure Linden's liver was actually not draining, which would involve laproscopicly injecting a die into her and they then would hope to see it filter into the gallbladder. If it did not drain, then they would go ahead and open her up and reroute her intestines directly to her liver to allow for drainage. This procedure is called the Kasai procedure. \n\n>At this point, our surgeon was the first to mention the word **transplant** to us. He said two-thirds of BA kids end up with liver transplants. This blew our minds as we realized the seriousness of her disease.  \n\nAfter receiving all the information about her surgery and asking as many questions as we could possibly think of, the surgery team went on their way. I remember anticipating that Tuesday night would be difficult. However it wasn't... another gift from God. Linden wasn't able to eat 6 hours prior to surgery, but she did great. I remember the whole walk down to the surgery room, she smiled the entire way. \n\n>I remember feeling sad, but not scared. Anxious but not worried.\n\nWe were able to go with Linden down to the surgery floor and be with her until they actually took her to the surgery room. While there, we met with the nurse who would be giving us periodic updates during surgery and met with the anesthesiologist who explained his part in the process. The anesthesiologist asked us about Linden's name. **He told us he had Linden trees in his back yard and that they are the sweetest trees that he knew of…fitting for our sweet girl.** \n\nWe had met with everyone that we needed to and it was time to pass Linden off to the nurse. This was the most difficult part; leaving my baby in the hands of someone else, not being able to be near to love on and cuddle her. She made it easier on us and smiled as we walked away. I cried. \n\nWe waited in the surgery waiting room and held our buzzer tight. The buzzer would go off when there was an update for us. Within the first 30 minutes we got an update that Linden's liver wasn't draining and she did in fact have biliary atresia, and that they were going to go ahead and perform the Kasai.\n\n***Side note:** I've never once googled biliary atresia, so please don't ask me any questions from google or tell me something that you heard or found…ignorance is bliss. :)* \n\nAfter 3 longs hours of surgery and several updates later, we finally got the final buzz telling us that surgery was complete and we could meet with the surgeon and then finally see Linden. Our surgeon explained to us that Linden did in fact have biliary atresia and did not have a developed gallbladder; her gallbladder was simply scar tissue. \n\n>He said she did \"beautifully\" during surgery and the next 24 hours were the most important. \n\nAfter our meeting, Jake then went to meet Linden in recovery while I moved our stuff from gen peds to the PICU. I remember walking into Linden's PICU room and seeing Jake holding her. She was swollen, had wires everywhere, but was sleeping soundly. We were happy to be on this side of things and ready to get our baby girl feeling better. My sweet family was able to be there too and I am so thankful. They were a perfect distraction, encouragement, and brought a feeling of normalcy to this very abnormal time. I will never ever be able to thank my parents enough for all they have done for us in the past year. I feel so blessed. \n\n\nThe next four days brought no road bumps and Linden recovered as quick as she possibly could. \n\n>They told us that we would be admitted for 7-10 days but on day 5 (July 21st) we were headed home. \n\nLinden's follow up appointments all brought good news, her liver immediately drained and her numbers were normal within 10 days. This was such a blessing, considering they told us they hoped for normal numbers within 3-6 months! The first leg of our journey was complete and we were praising God for his goodness through the previous weeks. \n",
// "published_at": "2014-05-25T19:30:00.000Z",
// },
// {
// "id": 5,
// "title": "Memorial Day Update",
// "slug": "memorial-day-update",
// "markdown": "\n\n![](/content/images/2014/May/LindenCutieWeb.jpg)\n\n**Yesterday** was a long one...Biliary Atresia kids have a faster metabolism since their liver is working overtime to do it's job, and as a result Linden is constantly hungry. Not being able to eat is pretty much par for the course when it comes to being in the hospital with her, but I can confidently say that for Laura and I, it is probably the most unpleasant part.\n\nThe reasoning is that the infections she gets usually cause swelling in parts of the GI tract which means if she eats solid foods, there is a possibility it could get stuck or not digested, or contribute to the infection rather than helping her out. That being the case, she is almost always put on some sort of food restrictions when we arrive, and often times before tests or sonograms.\n\nAfter a very long day of Linden not being able to eat, we were finally able to give her some clear liquids in the evening so she could have something in her belly before bedtime.\n\nWe all slept like champs and woke up this morning to the beautiful sunshine streaming in the windows. Happy Memorial Day!\n\n\n##Current Status\n\n**Today** Linden has had her eating restrictions lifted for the time being and we are letting her stuff her face with everything she can get her hands on. Scrambled eggs, cheese-its, banannas (a big favorite), little pieces of chicken, EVERYTHING!\n\nShe has been much happier then she was yesterday but is still having a hard time sleeping. She took a few very short naps today and is having a hard time getting to bed tonight, so we are praying that will change as quickly as possible.\n\nWe also found out that Linden's total [bilirubin](http://en.wikipedia.org/wiki/Bilirubin) (this is the stuff her liver won't drain normally) is at about an 8, which is up from when we first came into the hospital, and higher than it was before she had her surgery.\n\n>For comparison, the bilirubin of a normal person hovers between **1 and 1.2**\n\nThe doctors didn't seem super concerned as it looks like her actual liver function numbers are coming down, and the bilirubin values usually lag a little behind those but trend with them overall. Still, with numbers that high, its hard not to be a little concerned.\n\n**A major blessing** today was that we got moved to the 6<sup>th</sup> floor and off of the **PICU** floor which means she doesn't have to constantly be hooked to tons of monitors. We can pick her up and carry her around, or let her play on the floor mat they brought in tonight. That makes life much easier as she gets tired of sitting in a hospital bed pretty quickly. \n\n##Prayers for Lindy\n\nA few things to pray about for Linden:\n\n1. A good nights sleep - As I said, she is having some difficulty getting to sleep tonight, and she could really use it!\n\n2. Antibiotics to kick in and do their thing - If the antibioitcs don't clear things up, there could be bigger issues at stake.\n\n3. Linden may have a sonogram tomorrow which means more eating restrictions - pray she would be happy and consolable.\n\n4. Lastly, prayers for Laura as she will be staying with Linden in the hospital tomorrow as I work a half day. Pray for strength, patience, and endurance.\n\n##Thanks Everyone!\n\nSo thankful to have friend and family praying for us and for Linden! Wanted to close out with a quote my mom sent me today...\n\n> Sometimes life takes us places we never expected to go. And in those places God writes a story we never thought would be ours.\n\nCan certainly say we never thought we would be in the hospital with a daughter that has a disease less than one in one million kids are affected with, but God has used Linden's life to change ours, and to teach us more about and reveal clearer the face of our Saviour, our loving Father, and our friend, Jesus!",
// "published_at": "2014-05-27T01:52:15.000Z",
// },
// {
// "id": 6,
// "title": "Sleep Deprivation...It's a real thing.",
// "slug": "sleep-deprivation",
// "markdown": "\n{<2>}![](/content/images/2014/May/wagon.jpg)\n\nTuesday, May 26<sup>th</sup> will go down as one of the most memorable nights in the history of our hospital visits. I want to be careful to not sound pesimistic, ungrateful, or foolish; I know God was in complete control of each minute of my night. I truly do trust in His sovereingty and many times throughout the night took comfort in that fact. However having said that, I wanted to record the events that unfolded so that we can look back some day and laugh at the night I *barely* survived...\n\n---\n\n##The Schedule\n\n**12:00pm** — Jake and I decide that it might be best for me to head home for the night to spend some time with Graham, and get a good nights sleep. I committed, knowing a boy sometimes just needs his mommy. :)\n    \n**6:30pm** — I pack up, give Linden a kiss, and head out with tears in my eyes. It's so hard to have to choose one child over the other. I know Linden won't remember, and most likely Graham won't either but it makes my heart ache always being away from one of them.\n    \n**6:45pm** — I call Jake and ask him if he locked the deadbolt because I knew I didn't have a key to it. He said yes, but that he left me a key and told me where it was. \n    \n**7:15pm** — I pick up Graham from our friends house and head home. Upon arriving home, I grab the key and realize that he had left me the garage key and not the deadbolt. Oh my word!! At this point, I haven't showered all day, haven't eaten since 11:00am, and Graham and I are both sleep deprived. I call Jake and we figure out a plan — our friends were visiting Linden and he was just going to send the key back with them. Great, now I just have  two hours to kill. So Graham and I jumped in the car and decided to go get some dinner. Well, while in the car he fell asleep. I know how it is to wake the kid after he's sleeping and it would not be worth my efforts. \n    \n**7:45pm** — I decide to start heading back to Peoria to get the key, giving Graham a chance to sleep and avoiding driving around Bloomington for 2 hours. \n    \n**8:00pm** — I talk to Jake and he says Linden isn't a happy camper. So I decide to stay the night at the hospital with her (she's very much a mama's girl), and Jake then would go home with Graham.\n    \n**8:30pm** — The swap. At this point, I was completely taxed and ready for bed. \n    \n**8:35pm** — Walk into Linden's room where she is sound asleep, until she hears me walk by her bed and wakes up with a sweet smile on  her face. I won't lie...I was very happy to see her smile, give her a kiss, and lay her back down. Linden had different plans....\n    \n**9:00pm** — Linden is still awake and her nurse lets me know that they will do her anticibiotics shortly.\n    \n**9:15pm** — I give her the oral antibiotics, while her nurse sets up the IV antibiotics. \n    \n**9:30pm** — The nurse is still trying to get the antibiotics to flow.\n    \n**9:45pm** — She realizes the problem could be the position of her foot and so we reposition Linden, in the midst of her screaming and crying. \n    \n**10:00pm** — The nurse pulls the tape and bandages off of her IV to get a closer look.\n    \n**10:05pm** — The nurse leaves the room to get new bandages and Linden pulls the IV out of her foot. \n    \n**10:10pm** — The nurse realizes the IV was bent so it wasn't going to work anyway. She lets me know that they will put another IV in and to just give her a minute to set up.\n    \n**10:20pm** — We head down to the procedure room to poke her for an IV.\n    \n**10:25pm** — They can't get the IV in so the nurse calls for another nurse to help. \n    \n**10:35pm** — The second nurse finally gets it and Linden has completely had it. \n    \n**10:45pm** — After what seems like two rolls of tape, the IV is secured and we are headed back to our room.\n    \n**11:00pm** — She starts the IV antibiotics and they still won't flow — yeah.right.\n    \n**11:10pm** — She finally gets thee antibiotics working and leaves the room.\n    \n**11:10pm** — Linden decides it's party time and wants to play.\n    \n**11:30pm** — Linden is finally asleep.\n    \n**11:40pm** — IV machine beeps and antibiotics are finished, waking the sleeping babe.\n    \n**11:45pm** — Nurse returns after 5 minutes of a beeping machine, flushes Linden's IV and starts fluids. \n    \n**12:00am** — Linden is back to sleep.\n    \n**12:30am** — I fall asleep (still unshowered and starving).\n    \n**2:30am** — Our wakeup call from the nurse to draw blood and check vitals. I give Linden one more bottle before she is NPO for her sono.\n    \n**2:30 - 3:00am** — Linden cries\n   \n**3:00am** — Back to sleep she goes.\n   \n**4:00am** — The nurse comes in to empty the garbage and wakes us both up....true story.\n   \n**4:15am** — Linden is back asleep.\n   \n**5:00am** — Linden randomly wakes up and I put her back to sleep.\n   \n**5:30am** — Nurse comes in to give antibiotics.\n   \n**6:00am** — Linden is back asleep.\n   \n**6:30am** — Nurse comes in to tell us transportation is here to take Linden to her sono. While telling me this, Linden wakes up.\n   \n**6:45 - 8:00am** — Sonogram. This is literally a traumatic experience for both of us, which includes me literally having to hold her legs and arms down while the sonogram techs does her thing. She cries, I cry...it's a disaster. And we got the same lady from our first experience (<a href=\"http://www.loveforlinden.com/lindens-story/\">see Linden's story</a>). \n   \n**8:15am** — Back to our room to find out we have our favorite nurse for the day...yay! And I feed Linden a banana, and her smile appears again instantly. \n   \n**8:20am** — Jake arrives and I breath a sigh of relief, knowing I have some backup (and can maybe eat and shower). \n\nIt was seriously one thing after the next, I can't tell you how many times I prayed during the night. In.sane. However, Linden survived...I survived...and we had a good day today. :)\n\n---\n\n##Current Status\n\nSo Linden's current condition is...\n\nShe has been diagnosed with acute cholangitis, which is an infection of the common bile duct. In Linden's case, the common bile duct is her surgery site. This is her second time having cholangitis and she will probably get it again, as it's very common with the kasai. Her doctor is treating it with two antibiotics, one oral and one IV. \n\nTomorrow, she will get a picc line and we will go home with IV antibiotics. Her doctor is saying that we *should* get to go home tomorrow, but if not then it will be on Friday. \n\nLinden is in happy spirits and has spent most of her day riding around the halls in her red wagon, smiling and waving at everyone. So thankful for her typically sweet demeanor.\n\n##Prayer Requests\n\n1- **SLEEP!** Please pray that Linden gets a good nights sleep tonight. Although she doesn't act like it, she is very very tired.\n\n2- **NO FOOD!** Linden isn't able to eat 8 hours prior to the picc line procedure. Please pray that she handles that well and is able to rest and relax with an empty stomach.\n\n3- **THE PROCEDURE!** The picc line procedure requires sedation, which is always a little unsettling. Please pray that she would respond well to the anesthesia and the procedure would be seamless.\n\n4- **HOME!** Please pray that we will be able to go home tomorrow. We are craving sleep in our own beds and to be a family again. \n\n\nSo many friends have sent me scripture to meditate on during the last few days. I would like to share two of my favorites. \n\n>Psalm 91:1-2---He who dwells in the shelter of the Most High will abide in the shadow of the Almighty. I will say to the Lord, \"My refuge and my fortress, my God, in whom I trust.\"\n\n>Matthew 11:28---Come to me, all who labor and are heavy laden, and I will give you rest.\n\nAnd lastly, thank you all for the encouragment and compassion you've shown our family, even some whom have never met us or Linden. The love that we feel from you all is so humbling. Our hearts are grateful.",
// "published_at": "2014-05-29T01:46:16.000Z",
// },
// {
// "id": 8,
// "title": "Out of the frying pan...",
// "slug": "out-of-the-frying-pan",
// "markdown": "##Thursday\n\n\n###Pre-PICC\nThursday started out promising. We had a PICC line scheduled for 2:00 PM and although Linden wouldn't be able to eat from 6:00 AM until then, the prospects of heading home after a long few days at the hospital made it all worth it.\n\nThankfully, Linden was an absolute angel the entire day. We found that the secret to keeping her happy while fasting is distraction, namely, the big red wagon that we put her on with all her baby dolls and sock monkeys and rolled through the hallways. We affectionately called it the \"Linden Parade.\" She was shy at first, but once we got her waving, this future homecoming queen had a smile for everyone on the floor :)\n\nA few more Linden Parade laps followed by naps got us to the 2:00 PM mark, and the PICC team was right on time. Watching Linden go to sleep is always a little scary, but she did just great. An hour and a half later, we got to see our little baby still buzzed on the anesthetic, babbling to the doctors and the nurses like they were her best friends :) So funny.\n\n###Post PICC\n\nWhile doing the PICC line, they also drew labs, which is one of the BEST things about having it, no more pokes to draw blood! We had to wait for the lab results to come back before being discharged, but if all was good, then we were free to go.\n\nThe labs came back a short time later, and being what they were, required that she get one more dose of an IV drug before hitting the road.\n\nThe dose, was given, we got our meds for home, had our discharge papers, and *ran* out the doors into the fresh, warm, summer air. Ahhhhh....\n\nWe got home just in time to unpack a few things, get the house somewhat in order, and meet our home health nurse who had come by to give Linden her evening dose of antibiotics and retrain us how to do it as well. \n\n10:00 PM rolled around and we were finally all in PJ's and headed to bed... in our **own beds!** One of those things you take for granted until you sleep on a hospital recliner for a few days. Home at last... *or so we thought*.\n\n##Friday\n\nAn easy night, a good rest, a beautiful morning, and a happy family! I headed off to work for the first full day this week.\n\nThe home health nurse came to draw blood for labs in the afternoon and as protocol requires, she took her temp... **102&deg;**...This isn't good.\n\nA few phone calls later, and wouldn't you know it, we're headed back to the hospital. *That was quick.* \n\n##Welcome Back\n\nWe don't know exactly what is going on at this point but we do know that she spiked a fever, and she is lethargic. They admitted us back into the PIC so that if there is something seriously wrong they can deal with it quickly. We are hoping its just more of the same, but it sort of seems unlikely at this point.\n\nThey are going to keep treating her with her current antibiotics but are going to pull out the big guns if they can't figure out what is causing these fevers soon. In any case, we are **SUPER HAPPY** to have a PICC line so they don't have to do any more poking.\n\n##Prayers\n\nI'll probably expand upon this a bit more tomorrow, but we would greatly appreciate prayer for\n\n1. The Doctors - That the Lord would give them wisdom beyond their experience to be able to quickly diagnose and treat Linden's issue.\n\n2. Laura and I - That we would have patience, endurance, and peace during these trying times.\n\n3. Graham - He is starting to miss his Mommmy and Daddy being at home and is saying so. This is really difficult, probably one of the most difficult things each time we have to head back to the hospital. Plans for Graham, and doing what we can to maintain normalcy during these hospital stays can be a huge drain.\n\nThanks Everyone!\n\n> The Lord is my strength and shield. I trust him with all my heart.He helps me, and my heart is filled with joy. I burst out in songs of thanksgiving. The Lord gives his people strength. — Psalm 28: 7 - 8\n\n\n\n\n\n\n\n\n\n",
// "published_at": "2014-05-31T02:20:50.000Z",
// },
// {
// "id": 9,
// "title": "Third times a charm, right?",
// "slug": "third-times-a-charm-right",
// "markdown": "\n\n![](/content/images/2014/Jun/LindenImageweb.jpg)\n\nAfter being readmitted on Friday, we found out that Linden has rhinovirus, which is a very common respiatory virus. While for you and I the common cold is no biggie, for Linden it means a fever, higher biliruben and liver enzymes, and a visit to the hospital. It's a bummer to be readmitted for a second time, but a blessing they were able to find a source to her fever. Another infection could have been very serious for Linden. We were discharged about 1:15 on Saturday and happy to be on our way home with a pidly virus and **so so** ready to spend our Saturday with Graham. \n\n\n###And then....\n\nLinden was due for her second dose of IV antibiotics at 3:30. We scrubbed up and prepared all of the supplies. Jake began by trying to pull back (clean) the line and nothing was coming out of her picc. Not good. He tried again and all he was able to pull back was air. Shoot! We knew this wasn't good, so we called our home health agency and they sent a nurse. The nurse came and she also wasn't able to pull anything back or push anything through the line. Linden's picc line was occluded, which meant she wasn't able to get her much needed antibiotics (she had already skipped her afternoon dose), and we knew the probable solution....readmission. \n\nThe home health nurse called our (favorite) doctor and he made some phone calls. We were to head to the ED in Peoria, where we would meet the crisis nurse from peds. She would work her magic and try to get the picc working again. \nThat is just what we did. We arrived at the ED around 8:30 and were back in the room with the crisis nurse by 9:00. She did her very best to fix the line but was unsuccessful. She broke the news to us that we were going to be readmitted. I won't lie and say I was calm, cool, and collected. There were definitely some tears. I'm so thankful for supportive family and friends who are able to be a voice of reason and speak truth into me while going through another hospital admission.\n\nThe crisis nurse was very nice and got us out of the ED (it's pretty much a zoo on weekends) ASAP and up to our room. We waited around for awhile and by 11:00 they were poking Linden for another IV---they got it in on the second try and this time in her little footie. :( Poor girl hates being held down for IV's, it's heartbreaking. We were all ready for bed at this point and were conked out by midnight. \n\nLinden slept like a champ, which is a huge battle won. I know many of you were praying for a good nights rest so thank you. \n\n\n###The Plan...\n\nThe plan is to wait for the picc team to assess her picc line. There's a few things that can do before having to pull the whole thing and start new. Unfortnately the picc team isn't in on the weekends so we are here until tomorrow. The doctor who is on call this weekend is really pulling for us and has already left a message for the team so they can try and schedule us as early as possible tomorrow morning. Praying that's the case. \n\n\n###Prayer Requests...\n\nOf course **LINDEN**....she has been such a trooper, but is very tired and ready to bust out of this hospital. \n\n**GRAHAM**....He is starting to vocalize missing us and wondering why it's always  \"mommy, daddy, mommy, daddy.\" It's been heartbreaking appearing and disappearing from his life over the past week. We are trying to make his time away from us fun and special. Pray that he would continue to be resilient to all of this.\n\n**PICC SCHEDULE**...Pray the picc team is able to get us scheduled in the morning tomorrow. Also, that the problem can be fixed without inserting a whole new line.\n\n**NPO**....Linden won't be able to eat or drink again for 8 hours. I think it may be a form of torture to keep a one year old from eating for 8 hours. \n\n**CINCINNATI**....On Tuesday night we are heading to Cincinnati for Linden's last appointment before being listed. Please pray for endurance for us. We are very tired, but know this appointment needs to happen. It will be a full day of tests, which can be tiresome for all. While we are anxious for her to be listed, this past week has been emotionally and physicall exhausting and we anticipate Wednesay being the same. We are praying and expecting **grace upon grace** from our heavenly Father. \n\nThanks for the prayers and love shown to our family. \n\n>**Psalm 18** — God’s way is perfect. All the Lord’s promises prove true. He is a shield for all who look to him for protection. For who is God except the Lord? Who but our God is a solid rock? God arms me with strength, and he makes my way perfect. He makes me as surefooted as a deer, enabling me to stand on mountain heights.He trains my hands for battle;he strengthens my arm to draw a bronze bow.You have given me your shield of victory.Your right hand supports me; your help has made me great.\nYou have made a wide path for my feet to keep them from slipping.\n\nLaura",
// "published_at": "2014-06-01T14:47:10.000Z",
// },
// {
// "id": 10,
// "title": "Homeward Bound",
// "slug": "homeward-bound",
// "markdown": "![](/content/images/2014/Jun/HomewardBoundweb.jpg)\n\nFirst off, we are finally home... well, in a manner of speaking at least. I'm actually typing this on the way to Cincinnati, but we're not at the hospital anymore, and we were sleeping in our own beds last night, so that's good enough for me!\n\nLong story short, we were readmitted on Saturday night with an occluded PICC line and had to wait until Monday for the PICC team to get in and fix it. The plan was to have them replace the line since none of the nurses that tried  could get it to draw back or push anything through it. Saturday and Sunday came and went with visits from some good friends and Monday arrived.\n\nLinden had been fasting since midnight Sunday night and was a grumpy girl on Monday morning. I was home with a sick boy who caught something at the hospital during one of his visits so I wasn't able to help Laura distract her. It was looking like it was going to be a long day, but then came a PICC line nurse to the rescue. She fiddled with the line for about a minute and a half and had it fixed... seriously. **Praise God!** This cut hours off of our waiting time on the PICC team and kept Linden from having to be sedated, *PLUS* she got to eat immediatly. Talk about a happy baby.\n\nSome of our amazing friends offered to juggle kids and watch Graham while I headed to pick up Laura and Lindy Lu. **Home at last.**\n\n---\n\n##Hands and feet\n\nI wanted to quickly share one of the things that the Lord has been teaching me through the last few months. \n\nI remember in November when Laura had spent weeks prepping for Grahams 3<sup>rd</sup> birthday party and had spent most of the day getting decorations ready for the evening celebration. If you know anything about Laura, you know that birthdays are a **HUGE** deal. Graham's party was no exception. She was SO excited to celebrate with him. \n\nThat was the first time Linden got sick post-surgery. She wasn't doing well and Laura had to leave an hour before Graham's big party to take Linden to the ER. She missed Graham's party, heartbroken, and had to spend the entire night caring for a sick baby. \n\nI remember being frustrated and questioning where the Lord was in the situation. Of all the days to have Linden get sick, it had to fall on the day of Graham's party. I prayed a lot that night, and I remember thinking that it sure would be nice sometimes if instead of praying and trusting God to work on our behalf, he would send an angel or some magic genie or have some physical presenece in this world that would let me know He was doing something now. \n\nThat next morning I remember our good friend Marcia taking Graham super early and watching him that whole day (and almost the entire next week). Another friend Matt Knobloch offered to drive me 45 minutes to Peoria before he went to work that day since Laura had taken our car the night before. Before I left Marcia's house, she told me she would be praying for us and gave me money for lunch. When Matt picked me up, he brought a huge mug of coffee, talked to me the whole way over about Linden and how he could relate with his son Henry, then gave me money for dinner that night. While these might seem like little things, the Lord revealed clearly to my heart that day that he uses His own people in this world to be his hands and feet to His children in need. \n\nEvery time we head to the hospital to deal with another round of infections and late nights, I am again reminded of this truth the through kindness, compassion, and generosity of others. Money for gas, text messages in the middle of the night, giftcards for food, little girls selling bookmarks to raise money, friends running in Linden's honor, pastors mowing our lawn, prayers and kind facebook messages from strangers, all of these and countless other acts of unrepaid kindness teach us that while we often look for God in the large and the loud, he more often works in the silence as He whispers His will to the hearts of His children.",
// "published_at": "2014-06-03T22:57:03.000Z",
// },
// {
// "id": 11,
// "title": "Second Cincinnati Visit",
// "slug": "second-cincinnati-visit",
// "markdown": "![](/content/images/2014/Jun/parkweb.jpg)\n\nLinden's second appointment at Cincinnati Childrens was scheduled for this Wednesday, so Tuesday night we packed up the car and the kiddos and set out for the land of the Buckeyes. We arrived about 8:30 PM after watching Frozen three times in a row and eating lots of snacks to distract Graham and Linden.\n\nOur greeting party consisted of two grandparents, a sister, and three rambunctious boy cousins... Graham couldn't have been happier to see them! We spent most of the evening in our room pretending to be John Cena from WWE and doing choke slams and suplexes on the beds in the hotel. The boy cousins LOVE wrestling so this has become the regular routine whenever we see them :)\n\n###The Day Begins\n\nDuring our visits to Cincinnati the days start pretty early, and this time was no different. We were up and out the doors of the hotel at 6:30 (our time) having packed up the whole room we tore apart the night before. Our first appointment was with cardiology and that went super well other than having to wait an hour in the waiting room to be seen. This seriously wasn't a problem though for two reasons.\n\n1. Cincinnati Childrens is beautiful! They decorate so nice and do eveyrthing they can to make you feel at home.\n\n2. The guy from the desk who checked us in gave us $10 to the cafeteria and apologized for the wait... **Cha-Ching**\n\nAnyway, the appointment went really well. The cardiologist explained that many kids with Linden's condition develop heart issues (long story short) and she hadn't. Praise God! Who needs another problem to worry about right?\n\n###Anesthesia\n\nNext we had a consult with the anesthesiologist. We were reassured by her incredibly calm demeanor when explaining the entire process of the transplant. It occurred to us that while for us this is a **massive deal**, to the anesthesiologist on the team, doing a liver transplant is just another day on the job. Being North Americas no. 1 Pediatric liver transplant hospital, they do quite a few of these. What a blessing to be a half day drive from this type of care. There are people around the world who would gladly sacrifice everything to give their child the chance to see the doctors we get to. Thank you Jesus!\n\nJust before meeting the anesthesiologist we also had a chance to check out the waiting room where we will be spending about several hours during Linden's transplant. **It. Was. A. Zoo!** Seriously though, I love the hospital, but anyone who is coming in for any surgery at all, from heart transplants to removing a mole stays in this waiting room. Crazy! Maybe it will help keep our minds off things though, who knows.\n\n###Gastro\n\nOur last stop was to the peds GI floor where we met our doctors and nurses that we have been in contact with since our last visit and who will be in charge of Linden's care during her stay. They were all incredibly kind as always, and made us feel like family.\n\nThey drew labs, ran numbers, asked us some questions, then they told us that **Linden would be listed for transplant the next day**! Exciting and surreal at the same time. While it is great news that we have taken the next step towards Linden becoming a healthy normal baby girl, the weight of a transplant surgery, the weeks of recovery, and the years of anti-rejection medicine and an immuno-suppresed child is now a large reality looming in the back of our minds. \n\nAt any moment we could get a phone call to grab our things, stuff the kids into their car seats, and head back to Cincinnati to have our lives changed forever. Whew! \n\n---\n\n###Blessings\n\nWanted to share a few pieces of awesome news and also some cool things that the Lord has done since the last update.\n\n1. Linden is a universal recipient which means that she can get any liver from any blood type. This of course increases the pool of livers that are available to her!\n\n2. I can't even tell you how many people have sent us cards of encouragement and offered to help with kids or go get us groceries or bring us meals, etc. It has been hugely encouraging to have our church family and friends be so supportive during these trying times. What an awesome testimony.\n>By this all people will know that you are my disciples, if you have love for one another. — **John 13: 35**\n\n###Prayers\n\nLinden is currently healthy, and we would like for it to stay that way if possible. unfortunately in order to gain rank on the listing charts, she will likely need to get more sick. It would be awesome if Linden could get transplanted while she was still doing well. It's a long shot but it could happen.\n\nThere are a million other things I could probably put in here, but I'm tired and ready to hit the hay :) Until next time, thanks everyone for your prayers! We love you all!\n",
// "published_at": "2014-06-08T18:51:35.000Z",
// },
// {
// "id": 12,
// "title": "The Time is Here",
// "slug": "the-time-is-here",
// "markdown": "\n\n![](/content/images/2014/Jul/Transplant.jpg)\n\nLinden is currently in surgery getting her transplant! The last 24 hours have been a blur — but here is a quick recap.\n\n### Vacation Plans\n\nWe had originally planned to spend this weekend in Northern Illinois celebrating the Fourth of July with friends, but that plan was radically changed at 7:30 PM last night. After a beautiful 3 hour drive, we arrived at our destination in Galena, unloaded, and ordered from a local pizza joint.\n\nWe had barely finished cleaning up the kitchen and getting the kids in the bath when we got a phone call from Julie, our transplant nurse from Cincinnati. We had received a few calls from the nurses before including one earlier that day, so we didn't immediately think anything was up. After asking about Linden's current condition, she broke the news that they had an offer for a liver!\n\n### Pedal to the Metal\n\nTime is of the essence in these situations, so the fact that we were in Northern Illinois did not help the situation. We were outside of the range that the hospital will normally accept as a reasonable time for arrival at the hospital. We told Julie that we could be at the hospital in 6.5 hours if we left immediately (Google said 7.5 hours but I have a heavy foot). She called the doctor as we waited with bated breath. Minutes later, she informed us that the doctor approved and we should leave immediately.\n\nWe grabbed all of the packed bags we had just unloaded, threw them in the back of the car, prayed with our friends, and sped off to Ohio. I don't know how I didn't get pulled over on the way as I was nearly 15 over the speed limit the entire way! Two redbulls and 6.5 hours later we pulled into the hospital at 3:00 AM. \n\n\n### Our Angel Baby\n\nLinden woke up as happy as could be and was a little angel through admitting and getting set with IV's and what not. We all fell asleep on a pull out couch for a few hours and waited for the doctors to let us know our next steps.\n\nWe woke up this morning to a team of doctors and nurses introducing themselves and letting us know that Linden's surgery would be started in the next few hours! That pretty much catches you up to where we are now, waiting in a surgery consult room with family and getting updates on Linden's progress in surgery. \n\n---\n\n### Practically the Lottery\n\nThere are more than a few reasons why this is an amazing set of circumstances, but here are a few of those reasons.\n\n1. The average transplant wait time is about 3.5 months, Linden has been on the list 3.5 weeks.\n\n2. Almost all transplant patients are transplanted when their [PELD score](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CB0QFjAA&url=http%3A%2F%2Fwww.mdcalc.com%2Fpeld-score-pediatric-end-stage-liver-disease-younger-than-12%2F&ei=IHG1U6ySFI2TyASdo4LIAg&usg=AFQjCNGs1O4v0VR7QDEcZEQrFjgShY3fVA&sig2=DSKxj51kcCIicfNLjj3TUQ) is between a 25 and 35, Linden's is currently an 11.\n\n3. Many transplants in kids are split-liver transplants meaning they only get a part of a liver. This works fine most of the time, but can also introduce some complications not present in whole liver transplants. Linden not only received a liver matching her blood type exactly (AB+ the rarest there is) but also received a whole liver transplant!\n\nThe impact of these cannot be over stated! The fact that Linden is getting transplanted while she is still healthy also means her recovery will be much faster and should hopefully reduce her down time and our stay at the hospital.\n\nGod has been so good to us and to Linden and we have no doubt he will continue to be faithful to give us the grace and peace we need to make it through the next few weeks.\n\nThank you everyone so much for your prayers! We love you all!\n\n",
// "published_at": "2014-07-03T14:48:07.000Z",
// },
// {
// "id": 13,
// "title": "The Transplant",
// "slug": "the-transplant",
// "markdown": "![](/content/images/2014/Jul/Pumps.jpg)\n\nLinden was wheeled into pre-op about 8:30 this morning sleeping on Laura's shoulder, out like a light. They gave her a few sedatives and the nurses whisked her off to the bowels of the hospital to do their magic.\n\nOur transplant nurse was able to get us a huge consult room where we spent the majority of our day with the family members that were able to come down for the surgery. This gave us a little privacy from what is otherwise a zoo of a waiting room! We were super thankful for that :)\n\nThe surgery consisted of a few stages:\n\n1. Sedate Linden and get all the lines setup for surgery: 3 IV's, 1 Central Line, 1 Arterial Line, a breathing tube, and an NG tube.\n\n2. First incision and disecting current liver from its location.\n\n3. Placing new liver into body cavity and making necessary connections back to veins, arteries etc.\n\n4. Sew up skin and muscle if possible (many times only the skin can be sewed up initially due to swelling and later they close up the muscle)\n\n5. Final checks to be sure blood flow is sufficient and no clots have formed.\n\nThe tubes and IV's were completed uneventfully and we were informed by our transplant nurse when the first incision was made. The disecting of the current liver was performed amazingly by the surgeons. Most of the time a patient would need a blood transfustion during this part as removing a major organ from a body cavity can cause quite a bit of bleeding. This wasn't the case with Linden. The doctors were so precise that no blood was needed until after her new liver had already been placed. As a result Linden's vitals were rock solid through the entire surgery. Whew!\n\nPlacing the new liver and making the proper connections also went extremely well as they only had a few connections to make. They then unclamped everything, and watched the new liver turn from a gray color to pink in no time flat! The liver was even producing bile before they closed which is great news.\n\nDuring closing, the surgeons decided they had enough room to sew up the muscle layer as well which meant she wouldn't need to have a second sugery to close that! Finally they wheeled Linden up to the PICU to check blood flow with a sonogram before allowing us to see her. \n\nThis final check however proved to have less than desirable results. They found that the portal vein that supplies the blood for the liver was not providing sufficient flow. The decision was made by the transplant team to reopen and fix the problem by using an additional piece of vein from the donor liver to lengthen the portal vein. This would help to prevent future clots from forming and would allow additional wiggle room for this particular vein in the future.\n\nThankfully, we had family to laugh and talk with during this second two hour surgery which accoring to the transplant team was little more than a \"technical exercise.\" Linden was stable the entire time and now we are sitting on the sixth floor waiting to see our baby after a long day!\n\nWe are so thankful for the amazing surgical team here at Cincinnati and incredibly greatful for all the prayers, kind and concerned texts, and encouraging facebook posts and messages we received throughout the day. Of course we would be amiss if we didn't acknowledge the amazing God we serve and his incredible grace towards our family during the last day and a half.\n\nThrough all of this, we have taken comfort in this verse:\n\n>You saw me before I was born. Every day of my life was recorded in your book. Every moment was laid out before a single day had passed. \n\n> **— Psalm 139:16**\n\nWe know that God has a perfect plan for Linden and are praying for patience and peace as we walk with God through discovering that plan. \n\n### Prayers\n\n* Pray that Linden will recover quickly and that she will not have any further complications\n\n* Pray for rest and peace for us as parents\n\n* Pray for opportunities for us to share the amazing hope Christ has given us with those we encounter\n\nWe love you all! Thanks.",
// "published_at": "2014-07-04T02:25:17.000Z",
// },
// {
// "id": 14,
// "title": "Recovery",
// "slug": "recovery",
// "markdown": "![](/content/images/2014/Jul/LindenBow.jpg)\n\nNerves had set in by the time we were finally able to go back and see Linden in the PICU. I remember after her very first surgery at 10 weeks old how swollen she was after getting out of the operating room... nearly unrecognizeable. We were preparing for the worst, but we're completely shocked to see Linden looking almost completely like herself — with a few extra tubes of course :) Although she wasn't swollen like we had anticiapated it was a shock to see just how many tubes they can put into and onto one small body. The bay of machines they used to keep her going looked like a scene out of star trek!\n\nThe evening stayed busy, with nurses and doctors hovering around her bed for the remainder of the night, treating a slight fever and getting her caught up on all of the meds she missed during her surgery. With the exception of the fever and some minor bleeding (which were both terrifying at first), all of her symptoms were very normal and she slept through the night like a champ. We were able to get some much needed rest and woke up the next morning refreshed and ready to face another day in the PICU. \n\nOn Friday the doctors were able to pull Linden's breathing tube out, practically days ahead of schedule. All of her vitals remained stable and the nurses and doctors spent their time managing her pain and chasing her blood and liver numbers with meds. We were able to see Linden smile for the first time since her transplant (at her DADDY!!!), and enjoyed her being awake and alert quite a few times during the day. We thought it would be a while before we were able to see even a glimpse of Linden's personality come back, but she has suprised us again with how aware she has been.\n\nWe were also happy to see more friends and family show up at the hospital on Friday morning. Melissa and Kari (Laura's sisters) have been here since Wednesday night, but they got their chance to see Lindy this morning before leaving and taking Graham with them to northern Ohio for a few days. Laura's parents have been here since Wednesday night (all night) as well and were able to spend the majority of their day with us and Linden, bringing us meals, shooting the breeze, and just being available to watch Linden so we could get a break. We also got to see Sharon, Ryan (Lauras twin) and Liam as well as Kyle and Sara, two of Jake's besties from back in the neighborhood days of Flushing, MI. We got to see Jake's mom, brother, and sis-in-law on Thursday evening, and are hoping to see them again at the hospital on Saturday. It's always good to see people you are close with during these long stays, if for nothing else to talk about something other than the hospital for a while. We are so thankful for our supportive families and our wonderful friends who have been nothing but encouraging and positive through this entire ordeal. Whether leaving in the middle of the night to meet us in Cinci, or taking off work to be available, eating a meal with us or adopting Graham for a week, we so appreciate all you do to keep us sane and smiling :) We love you all so much. \n\nThe rest of the day was uneventful, save the trip to Cinci Famous Steak and Lemonade and watching about ten different fireworks shows from our window on the fifth floor! Watching fireworks and sipping a cherry lemonade last night, I was reminded of Gods'grace on our family over the last few days. We are truly undeserving of all the good we have been given. I couldn't help but think of all of those whose children never left the operating room, or who didn't get a transplant in time, or who were never diagnosed, or that family that had to lose life in order for Linden to keep hers. While there have been tears shed over the last few days, I can say that the majority of those tears have been in amazement and greatfulness for the incredible turn of events that have landed us here.\n\nThe verse that comes to mind to describe our situation is Ephesians 3:20\n\n> Now all glory to God, who is able, through his mighty power at work within us, to accomplish infinitely more than we might ask or think.\n\nWe have truly been given more than we could have ever thought to ask for. \n\n",
// "published_at": "2014-07-05T12:22:55.000Z",
// },
// {
// "id": 15,
// "title": "Our Weekend In Cinci",
// "slug": "our-weekend-in-cinci",
// "markdown": "<div id=\"video\"></div>\n\n<iframe src=\"//player.vimeo.com/video/100126864\" width=\"1000\" height=\"562\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n\nTrying to cover two days at once is a bit more difficult than one might think since so much happens in a day that it's hard to keep it straight. Here goes!\n\n### Saturday\n\nSaturday was a good day with Linden. She was able to get all of the tubes that were on her face and driving her crazy removed. They took out her NG tube which made her look much more like herself and much less like a sick baby.\n\nSome of the other things we have noticed is that she is looking pink. For most people this wouldn't be a big deal, but Linden has had a yellow hue to her skin color since very shortly after birth. Now that she has a new liver, her bili levels are beginning to drop and her skin is turning a normal color. In fact, we learned that she actually had tan lines on her legs from where her leg rolls are :) We couldn't see them before since her yellow skin color blended in with the tanned skin. Fat roll tan lines... not many things cuter than that.\n\nLinden was also able to enjoy solid foods for the first time since her transplant. We decided to give her a [banana to celebrate the occasion](#video) — her favorite! She grabbed it right out of Laura's hand and shoved it in her face as if any moment we might take it back. She demolished the entire banana in a few minutes and promptly dozed off to dream-land having spent her entire energy store scarfing her snack. Plenty of food and treats followed for the remainder of the day much to her delight.\n\nSaturday also brought some visitors from out of town who were visiting in Cinci, namely our good friends from college Ryan and Elissa King. They also brought with them some of the most delicious Mexican I have ever had. I think there were 4 bags of food in total and we still haven't finished all of the leftovers! They also decided to bring along an entire tote full of snacks including milano cookies which I promptly disposed of :) Thank you guys so much! Love you.\n\nWe said goodbye to Laura's parents who have been an incredible support to us this week! They took over on Graham duty back in Northern Ohio and are keeping him entertained for the next few days until they come back on Tuesday. Thanks Ma and Papa!\n\nWe were able to see my parents in the evening (who were witnesses to the banana face shoving incident) for almost an hour before visiting hours were over and they had to kick them out. \n\nIt was a good day but unforunately the night decided to be a bit more difficult. Linden was up quite a few times. It's always a challenge to decide if the problem is pain, hunger, or just a grumpy baby. Thankfully we had an awesome nurse that helped to man the crib while we got some rest. \n\n### Sunday\n\nOn Sunday Linden had a hard time as they tried to balance out her pain meds. It seemed that most of the day consisted of them making calls to adjust frequency or dosage of her pain meds so she could get some rest. After a long night, she wasn't in the mood to be uncomfortable and she let everyone know it. In the late afternoon, she finally seemed to hit a rhythm and took a good long nap!\n\nWe were able to spend the morning (eating a massive breakfast) and afternoon with my parents before they left in the late afternoon so we could get some rest along with Linden. We also got to eat lunch with Laura's twin brother Ryan, sis-in-law Sharon, and adorable nephew Liam (no seriously... adorable). Our last round of visitors was Laura's older brother Josh, sis-in-law Gret, and their three cutie pies Susie, Chip, and Bertie Boy. They also decided to bring along a big bag of clothes, books, and snacks for us.\n\nA few of the nurses have commented on how nice it is that we have so many family and friends to support us, we couldn't agree more! Whether near or far, we are so thankful for those who are praying with and for us or stopping by to say hello during some of these longer days.\n\nLinden got her first bath tonight in quite a while, ate lots of food (yes, milano mini-cookies count), and has dosed off to sleep for the night... hopefully.\n\n### Prayer\n\nLinden has one more surgery before they can hopefully sew her up for good. They will be going in to close the muscle layer of her incision on Tuesday or Wednesday. Pray for good rest until then and good results afterwards. They say she will probably be more uncomfortable after that then after her transplant surgery. Praying she recovers quickly and that the doctors can manage her pain well.\n\nThanks again everyone for all you do! Until tomorrow!",
// "published_at": "2014-07-07T15:56:07.000Z",
// },
// {
// "id": 16,
// "title": "Second Surgery Down",
// "slug": "second-surgery-down",
// "markdown": "![](/content/images/2014/Jul/CinciWeb.jpg)\n\nToday was a good day! Linden's second (and hopefully final) surgery is finally out of the way and she is headed towards discharge sometime next week. Before I get into the nitty gritty I'll review the last few days.\n\n### Monday\n\nMonday was the first day since arriving at the hospital that we didn't have visitors. Just Laura, myself, and the little lady kickin it in the room alone. We munched on snacks, caught up on some naps, and missed Graham as he spent time with his Ma and Papa a few hours north of us.\n\nWe also got moved out of the PICU and onto the transplant floor of the hospital. Well, technically it's not strictly a transplant floor, but all those who have had transplants end up there... all transplant patients are on the transplant floor, but not all patients on transplant floor are transplant patients... comprende? In any case, this floor has a food pantry, and that food pantry has name brand pop (soda)! We were pretty excited to hear that since the hospital we visit in Peoria only has a nasty off-brand called Shasta. Thank you Cincinnati!\n\nWe had a great nurse for the night shift and got a good nights rest even if there was a small bed that both of us couldn't fit on and I had to sleep on a foam floor mat — true story.\n\n### Tuesday\n\nTuesday we woke up to a girl in high spirits. Linden was awake for a good majority of the day and we each got to hold her multiple times to give her a break from her bed. We were happy to indulge her and spent the morning cuddling and playing with our sweet Lindy.\n\nTuesday also brought our little Graham man back to town. We were so excited to see him at lunch time and got to enjoy hearing the stories of the big fish he caught at Papa's house (see below) and all the fun he had with his cousins. After lunch we took Graham to the Cincinnati Museum Center which is the old Cincinnati train station converted into multiple museums and museum exhibits. Graham's favorite was the Woods section that reminded him of the Lost Boys hideout in Peter Pan. Between that and the dance party they had in the little theatre, he was a tired boy by the time we arrived back at the hospital.\n\n![](/content/images/2014/Jul/GrahamFishWeb.jpg)\n\nLinden however, was not tired... not at all. It was 8:30 by the time we were done eating Chinese with Laura's parents, and hanging out with Graham for a little longer, but Linden was just getting started with her evening. From 9 until 10:30 she was happy to just kick her little legs and smile her face off, but of course that got boring after an hour and a half. Before long she was pulling off her heart monitor and respiration leads and sticking them on her chin, her arms, trying to eat them, doing anything but leaving them alone and in place. I think we had to replace them a total of 3 times and ended up sticking them on her back instead of her chest so that she couldn't get to them. Many of you will think at this point, \"Oh isn't that cute, she doesn't even know what she's doing\" — except she totally did. Each time the machine would start screaming that her heart rate was zero and her breathing had completely stopped, one of us would get up to check her leads and discover her in bed smiling and waiting for us to discover where she had placed her leads this time. Her mischievous streak finally ended around 12:30 when she passed out from a fun overdose. Sleeping on a foam floor mat never felt so good.\n\n\n### Wednesday\n\nWe had found out on Tuesday that Linden would be an add-on surgery planned for Wednesday and as a result she had to fast from midnight on Tuesday up through her surgery time on Wednesday. She did surprisingly well with the fast and only asked for food a few times during the morning. We spent the morning in anticipation, waiting for the call that would take us back down to the operating room to close up Linden's muscle layer, pull her drains, and put in her central line.\n\nGraham was a welcome distraction arriving just after 9 with Laura's mom and dad. The rest of the morning up until the surgery was spent balancing pre-op consults with doctors, and playing with Graham and Linden. We were glad to see our wonderful friend from college Nadine come to the hospital just in time to wheel Linden down to the operating room. She is a nurse herself and is probably one of the best listeners either of us know. Talk about a perfect waiting room buddy! From there it was the same situation as her first surgery — pre-op room, followed by doctors and nurses, then us leaving for the waiting room and placing our trust in the hands of the doctors and the providence of our God.\n\nA half-hour in, we received an update that they had placed her central line and were getting ready to make their initial incision. It was a long hour and twenty minutes until we got to see the surgeon who had performed the surgery and hear that everything had gone well. The liver looked great and closing her incision all went as planned. Praise God! Another forty-five minutes and we were headed back to see Lindy waking up from her anesthesia. \n\nLinden went straight onto the morphine this time and was given a PCA which allows us to give her little boosts of morphine if she is experiencing pain instead of having to call the nurse to give her more meds every time! I'm the type to push that thing each time Linden so much as makes a peep, and Laura is the type to never push the button unless we have exhausted every other option... we do a good job of balancing each other out that way :) The rest of the evening has been spent making sure Linden is comfortable and that she gets some good rest through the night.\n\nWe are hoping and praying that our little Lu is back to herself, bouncing around and pulling off heart monitor leads before the weekend is out. The doctors seem to be confident that will happen, and it is looking like discharge from the hospital is on the radar for early next week! We are so happy to be on this side of the surgeries and so thankful for the miracles God has done to make that possible.\n\n![](/content/images/2014/Jul/LindenSleepWeb.jpg)\n\nThank you again everyone for keeping up with Linden's progress and for your constant and continued prayers for her health, her recovery, and our family's peace and joy.",
// "published_at": "2014-07-10T12:01:03.000Z",
// },
// {
// "id": 17,
// "title": "Rest and Recovery (again)",
// "slug": "rest-and-recovery",
// "markdown": "![](/content/images/2014/Jul/LindenOutsideWeb.jpg)\n\nIt has been a while since our last update, and to cover everything since then seems a little overwhelming! Instead I figured I would give an overview of the high points :)\n\n### Bounce Back\n\nIn our last update, we were praying that Linden would recover quickly, and be back to her old self in no time... **mission accomplished**. Linden was drinking clear liquids the night of her surgery and eating solid food by the next morning. She was off her morphine pump by the end of the next day and has since been totally weaned off of any pain meds. \n\nThe physical therapist and occupational therapists came by on Friday to see Linden and challenged her to sit up in her bed. Much to our surprise, she sat right up, and started playing with her toys in bed! She didn't sit for long, but now that we knew she was able to do so, we starting sitting her down on the floor mat they gave us and playing with her. Linden is back to scooting around on the floor, ripping up Kleenex tissues, playing with and throwing toys, all the fun stuff that she did before surgery and we couldn't be happier to see her personality and spunk back and stronger than ever :)\n\n### Linden's Personal Nurses\n\nThe doctors were very pleased with her progress and recovery and immediately put Laura and I on transitional care duty. This means that all of Linden's meds get switched to pill form or liquid form so that we can give them to her outside of the hospital. They then have nurses watch you for a few days while you give meds to make sure that you are doing everything correctly before sending you home and trusting that you can do it by yourself. Thankfully this isn't our first rodeo. Laura has been tracking Linden's myriad of meds since her first surgery at 10 weeks old and is a veteran of sorts when it comes to dosing and giving meds. \n\nAs long as we completed the transitional care aspect of things over the weekend, chances were good that we would be discharged on Monday! The one hitch was figuring out where we would be staying after discharge. The original plan was to stay at the [Ronald McDonald House](http://www.rmhcincinnati.org/) (RMDH) across the street from the hospital, but even applying almost a week and a half ahead of time, the waiting list looked to be too long. We were informed that we would need to find alternative options for housing until we could get off the list and into a room. Thankfully, we have been blessed recently when it comes to lists :) They called Saturday and let us know that they had a room for us!\n\nWe also had a good friend Tiffany Spies (Auntie Tiff) come visit over the weekend which was awesome :) She helped to keep Laura sane for another weekend and took Laura out for dinner on Saturday for some much needed girl time. As hard as I try, I just can't talk about The Bachelor for more than a minute and a half at a time but I'm pretty sure that Tiff knows the first and last name of each person on the show. No wonder these two get along so well.\n\nThe weekend went well, we passed the transitional care stuff, learned to change caps and dressing on Linden's central line, got some practice in with giving all 9 meds a day, and were discharged on Monday! We headed over to the RMDH as a happy little family and checked into our room... ahhhh...\n\n### Our New Normal\n\nEach day seems a little more normal as we continue to stay here at RMDH. There are a few caveats to this new normal however. The first is that in order for Linden to stay healthy and keep the body from rejecting her new organ, the doctors have placed her on a medicine that suppresses her immune system. It is a tricky balance between preventing rejection, and insulating from infection. These go hand in hand as you can imagine. By suppressing the immune system, the body won't fight against the new foreign object in Linden's body, but that also means it can't fight off many of the other infection and sickness causing bacteria the rest of our bodies shrug off as minor inconveniences. Because of this, we have to be extremely careful about germs.\n\nTo help protect Linden, anyone that is sick or has been within the last 24 hours can't be around her. Of course you can't always guarantee this germ free utopia, especially when in public, so we are on strict instructions to keep her out of \"crowded spaces\" for the first 3 months post-transplant. In addition, any time Linden is out in the wild, she has to be wearing a mask, OR be inside a covered stroller **unless** she is in an area with free flowing air (a.k.a. outside). At first Linden didn't mind her mask too much, as long as it was only on for a while. She did beautifully on her first trip outside as you can see below.\n\n<iframe src=\"//player.vimeo.com/video/100561964?byline=0&amp;portrait=0&amp;title=0\" width=\"500\" height=\"281\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n\n\nUnfortunately, wearing a mask gets old really quickly. Linden started biting them and ripping them off her face and crumpling them up after about half a day. We needed another option... thankfully we had a family friend contact us and let us know that she wanted to purchase a stroller for Linden that would allow us to cart the princess around without a mask on :) This was a huge blessing! Since then, we have been happily pushing Linden around in this pretty little pink buggy.\n\n![](/content/images/2014/Jul/LindenBuggyWeb.jpg)\n\n### Busy Week\n\nThe stroller has seen quite a bit of action this week as we have had visitors nearly every day.\n\nJordon and Rebecca Brill visited us on Monday and Tuesday this week. While here we made a little trip to [Ault Park](http://www.aultparkac.org/), went to Five Guys to grab some amazing burgers, then capped off the two day fun fest at the Melting Pot, courtesy of my awesome employer [Wilber](http://www.wilbergroup.com). Yes a beet juice cleanse is on the list for when we arrive home.\n\nWednesday was Linden's first appointment which went extremely well — **all numbers are now normal** or trending downwards! Praise God. After that, Graham and I headed to the Cinci Zoo while Laura and Lindy headed back to the RMDH for naps. It was a perfect day with perfect weather and the zoo was packed to the gills! After returning from the zoo, we entertained ourselves until the moment Graham had been waiting all day for finally arrived... Ronald McDonald came for a visit! He had a great time playing hide and seek and Simon says with Ronald and the rest of the kids here at the house for an hour before Ronald loaded back up in his fry-mobile and drove back to hamburger land. \n\nThursday Laura's parents came back down to visit for the afternoon and evening. We headed to the Montgomery Inn Boathouse restaurant right on the Ohio river and enjoyed some amazing ribs followed by some walking on the boardwalk and Graham running around without a shirt on, imitating the runners he saw. Crazy kid :)\n\nFriday was grocery shopping, and another appointment, again with minimal changes and all thumbs up from the doctors. Usually the plan is to stay for 4 to 6 weeks post-transplant to level out all the meds and make sure the patient is doing well, however if there is one thing we have learned with Linden, it is to always expect the exceptions, good or bad :) In this case, its looking like it might be good. The doctor we have been seeing while our primary doctor is away is telling us that we may be able to go home as early as next week which would be AMAZING! In the meantime, we continue to stay busy and bide our time until we can be back in the comfort of our own home!\n\n### Thank You\n\nThere are many of you that will read this that have been a blessing to our family! While I do plan on sending out actual thank you cards of some sort, I wanted to say here first, **THANK YOU SO MUCH**! Letters of encouragement, texts letting us know you are praying for us, gifts, snacks, food, gift cards for food, the ten pounds I have gained because of that food, all of it... thank you! Even if we don't get a chance to say it immediately, we hope to be able to say it to you face to face eventually and will also say it here, **we love you**!\n\n\nLastly we want to acknowledge how humbling it is to be one of the families to have a child who is doing as well as Linden is. There are so many families here at the RMDH whose children have cancer, or who have a 14 week old going into his 7th surgery, or who have a life long condition that requires constant assistance and care. It is impossible for us to complain about any of our circumstances for long when we look into the realm of what could have been, then look back at our beautiful healthy baby and the heaps of miracles and grace that has been poured out on our family to make that a reality.\n\n> I will praise you forever for what you have done; in your name I will hope, for your name is good. I will \npraise you in the presence of your saints.\n\n> **— Psalm 52:9**\n\n",
// "published_at": "2014-07-18T20:08:59.000Z",
// },
// {
// "id": 18,
// "title": "The Long Haul",
// "slug": "the-long-haul",
// "markdown": "![](/content/images/2014/Jul/HappyKids.jpg)\n\nHello world! After Linden was discharged from the hospital, we implemented our super secret plan code named **Radio Silence**... or at least it probably seems that way. Reality is far less intriguing but the result has been the same. Truth be told, taking care of Linden without the assistance of nurses on call 24/7 and then adding a 3 year old with amounts of energy rivaling that of a jack russel terrier who discovered your chocolate covered espresso beans, happens to be a lot of ...FUN! Ha, you thought I was going to say work didn't you? Well it is that as well, but we have honestly just been enjoying spending time together as a family. The time to blog about Linden's amazing progress has been on the list for the last two weeks but just hasn't happened. Enough with the preface though, here is the long and short of things.\n\n### Our Host Ronald\n\nSince Linden's discharge from the hospital we have been staying at the Ronald McDonald house. The rooms and accommodations are somewhat like those you would find at an extended stay hotel. You make your own beds, take out your own trash, clean your own floors and bathrooms, all in exchange for a price tag that can't be beat — donation — and 2 or 3 meals a day made by volunteers. These meals so far have even included Eli's BBQ (heaven on a plate) and some of the best fried chicken you have ever tasted. As if that wasn't good enough, the RMDH has a play ground with swings, play houses, little lizards crawling all over the place that we try to catch, as well as lots of kids that want to play. Then there is the DVD collection, the craft room, free daily activities and parties, visits from famous athletes and the list goes on. \n\nOne could almost be tempted to think, man it must be nice — and yes, it does help the time pass — but the reason for all the entertainment is to help parents, siblings, and patients make it through what can become a mind numbing experience. Having a child that requires isolation from the outside world for a large majority of most days can become a drudgery in a very short amount of time. Thankfully, the RMDH has largely helped to offset that.\n\nOne of the biggest relief's has come in the form of visits by friends and family who have thus far survived the grueling summer construction and traffic on the highways, as well as the drive through the ghetto surrounding the hospital. Thanks guys!\n\n### Caution Tape\n\nSpeaking of isolation, a few people have asked just how long it is that Linden needs to be isolated, and what exactly isolation entails. The critical time for Linden is really the first three months post-transplant. If she were to get sick within these first three months, it could spell trouble. The largest reason for this is that her immune system is being suppressed by the medicine the doctors are giving Linden. So say she gets sick...do they take her off the meds and hope her immune system fights off the infection while risking  liver rejection, or do they give her medication to help fight the infection and cross their fingers that it will work? It depends completely on the type of infection or virus of course, but the easiest road to take is the one where the doctors don't have to make that choice — in short, don't get sick. Isolation is a way to do that by keeping Linden away from large crowds and sick people.\n\nWe actually had a little scare last week when Linden's viral markers spiked and her liver function numbers started to show signs of distress. We prayed and held our breath along with the doctors for the better part of a week while we waited to see what would happen. Thankfully to our relief, after about 5 days, her numbers were starting to come back down, and have been continuing to trend back to normal range. The scariest part of hearing anything about a virus is the recent story of a girl we met who got a virus after a liver transplant and ended up hospitalized for 5 months! No thanks, I would rather stay inside for a few months at home than in a hospital any day. In fact, if her stroller is equipped with caution tape and automated sanitizer sprayers next time you see her, don't be surprised.\n\n### Home on the Horizon\n\nSo then on to the big question, is home on the horizon? Hopefully, YES! The last piece of the puzzle that doctors are trying to work out right now is getting Linden's med levels stable. There are a few meds that require fine tuning in order to come within the tolerances they have assigned. Just how fine tuned you ask? Well for starters, one specific med has to be given within 5 minutes of a set time twice a day with no exceptions. Also, the medicine has to be taken the same exact way every time. If you gave the med with apple sauce the first time, welcome to the world of apple sauce — you will be giving it to her with that from now until kingdom come. If you gave it to her with tepid distilled water in a 72&deg; room at 20% humidity, break out the humidistat and crank that AC baby because that's how she will need to take it FOREVER! You may notice that I'm being slightly facetious here but seriously, it's that important. The way this medicine gets absorbed into her blood stream can vary wildly depending on the factors surrounding the dose, so it has to be the same every time. \n\nThis is just one of a few different medicines that the doctors have had to fiddle with over the last weeks to get into proper range. Today we got good news that the most sensitive medication fell within the acceptable range during her last blood draw. Now we just have to hope and pray that the med level stays solid and that our primary liver doctor is sufficiently satisfied with Linden's progress when we see her again on Tuesday. If that happens, everything is looking good for us to pack up and head home sometime mid-next-week.\n\nIt's still super surreal to believe that we now have two healthy children. My mind has a difficult time adjusting from thinking when our next two-week hospital stay will be, to realizing that (hopefully) surgeries and long hospital stays will not be a part of our future. We are so incredibly thankful for Linden's miraculous healing and for all of the support and love we have received during this entire process. Thank you for your continued prayers during these next few crucial months. Talk to you all soon (in person) :)!",
// "published_at": "2014-07-31T05:09:22.000Z",
// },
// {
// "id": 19,
// "title": "Home at Last",
// "slug": "home-at-last",
// "markdown": "\n\n![](/content/images/2014/Aug/HomeAtLast.jpg)\n\nTwo weeks ago yesterday, we packed our vehicle to the gills, loaded two tired kids into their car seats, grabbed a few fizzy drinks for the road, and hit the highway in hot pursuit of home. The asphalt seemed to pass under foot much faster during this trip than the last time we made this drive as a family in the opposite direction. We were leaving with hearts full of joy and gratefulness for the grace of God on our family during the previous 5 1/2 weeks.\n\nAlthough I had been able to get home for a week of work during Linden's stay in Cincinnati, Laura hadn't been back for a month and a half. During the last leg of the trip, instead of taking the highway around the loop of the city to the north side, Laura requested that we get off the highway and drive straight down the main street. \n\n\"I feel like so much has changed since I was last here... is that a new hotel?\"\n\nIt wasn't... it's amazing how unfamiliar your native territory becomes when you are removed from it for an extended period of time. The unsettled feeling leaving your temporary home only to arrive back in a city you feel has continued normal (pun) life without your careful supervision is an odd sensation to be sure. \n\nPulling in the driveway, we threw open the front door and were welcomed by the familiar smell of home. The only thing I can really liken it to is coming back home after being gone at college for a semester. You could never really describe to anyone what your home smells like, but you know it when you walk in the door... unfortunately, we had left cottage cheese in the fridge so it was a bit more sour than normal but you get the idea.\n\n\n### Life on the Homestead\n\nArriving back in Normal and and resuming normal life are two totally different things regardless of how similar they sound. While being at home has certainly been a welcome relief from doing life inside a single bedroom dwelling, the circumstance surrounding the reasons for staying cooped up remain the same. Linden is still in isolation and will be for another 5 or 6 weeks (October 4<sup>th</sup> to be exact). Until she is totally off of her steroids and her anti-rejection pill doses are lowered, she is still very susceptible to sickness and viruses.\n\nI think originally we were much more optimistic about what isolation would mean once we arrived home. However, just before leaving Cincinnati we were informed that Linden had acquired EBV virus during the days or weeks following her transplant. Almost everyone has been exposed to this virus at some point in their life, likely without any noticeable symptoms. The only thing that made this a larger issue for Linden was the timing of her exposure. Due to the fact that her immune system was inhibited during the time she was exposed to the virus, it opens up the door for complications. Some of these complications can be as small as an extra scan or test, while other times it can mean additional months in the hospital. That being said, our tolerance and caution level for what are appropriate environments for Linden has been significantly heightened.\n\nThis ultimately means that Laura is still at home with the kids most days, and spends much of her time entertaining them with crafts, stuffed animal fights, hide and seek (hint: Graham is in the closet), or just letting Linden dump the entire tupperware full of the kids plastic ware on the floor (I choose my battles she says). She is being a trooper and a wonderful mother to our kids but could use your prayers as she disperses every ounce of her sanity, strength, and creative energy through these final weeks of isolation... oh, by the way, did I mention that my beautiful wife is pregnant? She is... and yes, she is tired... and sick. My wife is a superhero. And also, this was not planned. Did you guess that already?\n\n### More than we can handle?\n\nAt the beginning of this journey, I had always thought that the Bible promised us that we would never be given more than *we* could handle. I have found this to be entirely false throughout the course of Linden's short but very eventful life. In fact, I find this to be true on nearly a weekly basis. I don't say that to claim the Bible is lying or somehow contradictory, rather I mean to prove the point that in *our own* strength, courage, and stamina, we would have failed long ago. Thankfully, God never asks us to bear the heavy burdens of this life that we so often feel tasked to carry. It is not our responsibility as children of an all-sufficient Father to tough it out, or do it on our own, or meet God half-way, rather we are graciously called to **\"cast all your anxieties on him, because he cares for you\"** (I Peter 5:7).\n\nI could copy and paste an entire article I just read reminding me of this very thing, but instead I'll just give you the link ([read the article here](http://www.desiringgod.org/blog/posts/why-god-gives-us-more-than-we-can-handle)) and ask you to take 5 minutes and read it. It helped me to remember that my faith does not reside in my ability to be a good father, a good provider, a good person, to hold up under pressure, to comfort a hurting heart, to heal my child, to handle my problems, or to predict tomorrow. My faith rests squarely on the one who **“did not spare his own Son but gave him up for us all, how will he not also with him graciously give us all things”** (Romans 8:32).\n\n\n---\n— P.S. [other awesome article](http://solidjoys.desiringgod.org/en/devotionals/we-can-do-nothing) for those of you in the reading mood.\n\n\n",
// "published_at": "2014-08-23T04:33:40.000Z",
// }